Repository: weblate/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/tor.po
Languages: bg

source: Connecting to Tor
bg: Свързване с Tor

source: When OnionShare starts, it will show you a screen asking you to connect to the Tor network.
bg: След стартиране OnionShare показва екран, който ви приканя да се свържете с мрежата на Tor.

source: You can toggle on the switch "Connect to Tor automatically" before clicking "Connect to Tor". This means that next time OnionShare starts, it will automatically connect with its Tor connection settings from the last session, instead of presenting you with the connection options. If the connection fails, you can still try bridges or reconfigure Tor via the "Network Settings" button.
bg: Можете да отметнете „Автоматично свързване с Tor“, преди да изберете „Свързване с Tor“. Това означава, че при следващото стартиране OnionShare ще се свърже автоматично с настройките за връзка с Tor от последния сеанс, вместо да ви представя диалог за свързване. Ако връзка не бъде установена можете да опитате мостове или да промените настройките на Tor чрез бутона „Настройки на мрежата“.

source: You can click "Connect to Tor" to begin the connection process. If there are no problems with your network, including any attempts to block your access to the Tor network, this should hopefully work the first time.
bg: Изберете „Свързване с Tor“, за да започне процеса на свързване. Ако няма проблеми с мрежата, включително блокиране достъп до мрежата Tor, надяваме се, че това ще се случи от първия път.

source: Or, if you want to manually configure Bridges or other Tor settings before you connect, you can click "Network Settings".
bg: Ако, преди да се свържете, искате ръчно да настроите мостове или други аспекти на Tor, можете да изберете „Настройки на мрежата“.

source: Automatic censorship circumvention
bg: Автоматично заобикаляне на цензура

source: When you click "Connect to Tor", if OnionShare fails to connect, it might be because Tor is censored in your country or on your local network.
bg: Когато щракнете върху „Свързване с Tor“, ако OnionShare не успее да се свърже, това може да се дължи на факта, че Tor е цензуриран във вашата държава или местна мрежа.

source: If this occurs, you will have these choices:
bg: Ако това се случи, имате следните възможности:

source: Try again without a bridge
bg: Повторен опит без мост

source: Automatically determine my country from my IP address for bridge settings
bg: Автоматично определяне на държавата от IP адреса за настройване на мост

source: Manually select my country for bridge settings
bg: Ръчно избиране на държавата за настройване на мост

source: If you choose the "Try again without a bridge" option, OnionShare will retry connecting to Tor like normal, without attempting to bypass censorship.
bg: Ако изберете „Повторен опит без мост“, OnionShare ще опита да се свърже с Tor както обикновено, без да заобикаля цензурата.

source: The other two options will attempt to automatically bypass censorship using Tor bridges. If your network provider is blocking access to the Tor network, you can hopefully still connect to a Tor bridge, which will then connect you to the Tor network, circumventing the censorship. Both of these options use the Tor Project's Censorship Circumvention API to provide you with bridge settings that should work for you. OnionShare will temporarily use the `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ domain-fronting proxy to make a non-Tor connection from your computer to Tor's Censorship Circumvention API. The Meek proxy hides the fact that you are trying to find a way to connect to Tor.
bg: Другите две настройки ще се опитат автоматично да заобиколят цензурата с помощта на мостове на Tor. Ако доставчикът ви възпрепятства достъпа до мрежата на Tor, се надяваме, че все пак можете да се свържете с мост на Tor, който ще ви свърже с мрежата на Tor, заобикаляйки цензурата. И двете възможности използват API за заобикаляне на цензурата на проекта Tor, за да ви предоставят настройки на мостовете, които би трябвало да работят. OnionShare временно ще използва прокси сървъра с домейн `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_, за да осъществи връзка извън мрежата на Tor от компютъра към API за заобикаляне на цензурата на Tor. Прокси сървърът Meek скрива факта, че се опитвате да намерите начин да се свържете с Tor.

source: If you choose "Automatically determine my country from my IP address for bridge settings", the Censorship Circumvention API will consider your IP address (yes, your real IP address) to determine what country you might reside in. Based on the country information, the API will try to automatically find bridges that suit your location.
bg: Ако изберете „Автоматично определяне на държавата от IP адреса за настройване на мост“, API за заобикаляне на цензурата ще вземе предвид вашия IP адрес (да, истинския ви IP адрес), за да определи в коя държава сте. Въз основа на тази информацията API ще се опита автоматично да намери мостове, които отговарят на вашето местоположение.

source: If you choose "Manually select my country for bridge settings", the Censorship API will find the bridges that suit the country that you specified.
bg: Ако изберете „Ръчно избиране на държавата за настройване на мост“, Censorship API ще намери мостовете, които отговарят на посочената от вас държава.

source: How automatic censorship circumvention works
bg: Как работи автоматичното заобикаляне на цензурата

source: If the Censorship Circumvention API finds bridges that it believes will suit you, OnionShare will try to reconnect to Tor using those bridges. If the API does not find any bridges for your location, OnionShare will ask the API for "fallback" options, and then try to reconnect using those.
bg: Ако API за заобикаляне на цензурата открие подходящи мостове, OnionShare ще се опита да се свърже отново с Tor, като ги използва. Ако API не открие мостове за вашето местоположение, OnionShare ще поиска от API резервни варианти и ще се опита да възстанови връзката, като използва тях.

source: If for some reason OnionShare fails to connect to the Censorship API itself, or if the API returns an error message, OnionShare will attempt to use the obfs4 built-in bridges.
bg: Ако по някаква причина OnionShare не успее да се свърже със самия API за заобикаляне на цензурата или ако API върне съобщение за грешка, OnionShare ще се опита да използва вградените мостове на obfs4.

source: It's important to note that the requests to the Censorship Circumvention API do not go over the Tor network (because if you could connect to Tor already, you wouldn't need to connect to the API).
bg: Важно е да се отбележи, че заявките към API за заобикаляне на цензурата не преминават през мрежата Tor (ако можехте да се свържете с Tor, нямаше да е необходимо да се свързвате с API).

source: Even though it's hard for an adversary to discover where the Meek request is going, this may still be risky for some users. Therefore, it is an opt-in feature. The use of Meek and non-torified network requests are limited only to making one or two requests to the Censorship Circumvention API. Then Meek is stopped, and all further network requests happen over the Tor network.
bg: Въпреки че за противника е трудно да открие къде отива заявката на Meek, това може да бъде рисковано за някои потребители. Поради това тази настройка е по избор. Използването на Meek и мрежови заявки извън мрежата на Tor е ограничено само до извършването на една или две заявки към API за заобикаляне на цензурата. След това Meek спира и всички по-нататъшни заявки се извършват през мрежата Tor.

source: If you are uncomfortable with making a request that doesn't go over the Tor network, you can click "Network Settings" (or the Settings icon in the bottom right corner, followed by the Tor Settings tab in the screen that appears), and manually configure bridges. After you save any bridge settings, OnionShare will try to reconnect using those bridges.
bg: Ако не желаете да правите заявкаи извън мрежата Tor, можете да щракнете върху „Настройки на мрежата“ (или върху „Настройки“ в долния десен ъгъл, последвана от раздела „Настройки на Tor“ в появилия се екран) и ръчно да настроите мостове. След като запазите настройките на мостовете, OnionShare ще се опита да се свърже отново, като използва тези настройки.

source: Manually configure Tor settings
bg: Ръчна настройка на Tor

source: You can get to the Tor settings by clicking "Network Settings" on the welcome screen, or by clicking the "⚙" icon in the bottom-right corner of the application, and then switch to the Tor Settings tab in the screen that appears.
bg: Можете да стигнете до настройките на Tor, като щракнете върху „Настройки на мрежата“ на началния екран или пиктограмата „⚙“ в долния десен ъгъл на приложението, след което отворите раздела „Настройки на Tor“ в появилия се екран.

source: Here are the different ways you can configure OnionShare to connect to Tor:
bg: Ето различните начини, по които можете да настроите OnionShare да се свързва с Tor:

source: Use the Tor version built into OnionShare
bg: Използване на вграденото в OnionShare издание на Тор

source: This is the default, simplest and most reliable way that OnionShare connects to Tor. For this reason, it's recommended for most users.
bg: Това е стандартният, най-простият и надежден начин за свързване на OnionShare с Tor. Поради тази причина той се препоръчва за повечето потребители.

source: When you open OnionShare, it launches an already configured ``tor`` process in the background for OnionShare to use. It doesn't interfere with other ``tor`` processes on your computer, so you can use the Tor Browser or the system ``tor`` on their own.
bg: При отваряне OnionShare стартира настроен процес на ``tor`` във фонов режим. Тези процес не пречи на останалите процеси на ``tor`` на устройството, така че Tor Browser или системният ``tor`` могат да бъдат използвани едновременно.

source: **Using bridges**
bg: **Използване на мостове**

source: To use a bridge, you must select "Use the Tor version built into OnionShare" and check the "Use a bridge" checkbox.
bg: За да използвате мост, трябва да изберете „Използване на вграденото в OnionShare издание на Тор“ и да изберете настройката „Използване на мост“.

source: Try using a built-in bridge first. Using `obfs4` or `snowflake` bridges is recommended over using `meek-azure`.
bg: Опитайте първо да използвате вграден мост. Препоръчва се използването на мостове `obfs4` или `snowflake` пред използването на `meek-azure`.

source: If using a built-in bridge doesn't work, you can request a bridge from torproject.org. You will have to solve a CAPTCHA in order to request a bridge. (This makes it more difficult for governments or ISPs to block access to Tor bridges.)
bg: Ако използването на вграден мост не работи, можете да поискате мост от torproject.org. Ще трябва да решите CAPTCHA, за да поискате мост. (Това затруднява правителства или интернет доставчици да блокират достъпа до мостовете на Tor.)

source: You also have the option of using a bridge that you learned about from a trusted source.
bg: Също така можете да използвате мост, за който знаете от надежден източник.

source: Attempt auto-configuration with Tor Browser
bg: Опитване на автоматична настройка чрез четеца Тор

source: If you have `downloaded the Tor Browser <https://www.torproject.org>`_ and don't want two ``tor`` processes running, you can use the ``tor`` process from the Tor Browser. Keep in mind you need to keep Tor Browser open in the background while you're using OnionShare for this to work.
bg: Ако сте `изтеглили Tor Browser <https://www.torproject.org>`_ и не искате да имате два процеса на ``tor``, можете да използвате процеса ``tor`` от Tor Browser. Имайте предвид, че в такъв случай трябва да държите Tor Browser отворен на заден план, докато използвате OnionShare.

source: Using a system ``tor`` in Windows
bg: Използване на системния процес на ``tor`` под Windows

source: This is fairly advanced. You'll need to know how edit plaintext files and do stuff as an administrator.
bg: Настройката изисква сравнително напреднали умения, като например редактиране на файлове с настройки и управление на операционната система.

source: Download the Tor Windows Expert Bundle `from the Tor website <https://www.torproject.org/download/tor/>`_. Extract the compressed file and copy the extracted folder to ``C:\Program Files (x86)\`` Rename the extracted folder with ``Data`` and ``Tor`` in it to ``tor-win32``.
bg: Изтеглете пакета Tor Windows Expert Bundle `от страницата на Tor <https://www.torproject.org/download/tor/>`_. Разархивирайте компресирания файл и копирайте получената папка в ``C:\Program Files (x86)\``. Преименувайте разархивираната папка, която съдържа папките ``data`` и ``tor`` на ``tor-win32``.

source: Make up a control port password. (Using 7 words in a sequence like ``comprised stumble rummage work avenging construct volatile`` is a good idea for a password.) Now open a command prompt (``cmd``) as an administrator, and use ``tor.exe --hash-password`` to generate a hash of your password. For example::
bg: Измислете парола за порта за управление. (Препоръчително е да използвате последователност на 7 думи, напр., ``comprised stumble rummage work avenging construct volatile``, е добра идея за парола.) След това отворете команден ред (``cmd``) като администратор и изпълнете командата ``tor.exe --hash-password``, за да създадете отпечатък на паролата. Например::

source: The hashed password output is displayed after some warnings (which you can ignore). In the case of the above example, it is ``16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.
bg: Отпечатъкът от паролата е изведен след няколко предупреждения, които можете да пренебрегнете. В примера, показан по-горе, отпечатъкът е ``16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.

source: Now create a new text file at ``C:\Program Files (x86)\tor-win32\torrc`` and put your hashed password output in it, replacing the ``HashedControlPassword`` with the one you just generated::
bg: След това създайте нов текстов файл ``C:\Program Files (x86)\tor-win32\torrc`` и поставете отпечатъка от парола след ``HashedControlPassword``::

source: In your administrator command prompt, install ``tor`` as a service using the appropriate ``torrc`` file you just created (as described in `<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_). Like this::
bg: В командния ред с администраторски права инсталирайте ``tor`` като услуга (както е описано в `<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_), използвайки файла ``torrc``, който току-що създадохте. Ето така::

source: You are now running a system ``tor`` process in Windows!
bg: Сега вече ``tor`` работи като услуга в Windows!

source: Open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using control port", and set "Control port" to ``127.0.0.1`` and "Port" to ``9051``. Under "Tor authentication settings" choose "Password" and set the password to the control port password you picked above. Click the "Test Connection to Tor" button. If all goes well, you should see "Connected to the Tor controller".
bg: Отворете OnionShare, щракнете върху пиктограмата „⚙“ и отворете раздела „Настройки на Tor“. Под "Как OnionShare да се свързва с мрежата на Tor?" изберете „Свързване, чрез порт за управление“ и за полето „Порт за управление“ задайте стойността ``127.0.0.1`` и ``9051`` за – „Порт“. Махнете отметката на „Без удостоверяване, нито с бисквитка“ и в полето „Парола“ въведете изпраната по-рано парола. Щракнете върху бутона „Проверка на връзката с Тор“. Ако всичко е наред, трябва да видите „Има връзка с контролер на Tor“.

source: Using a system ``tor`` in macOS
bg: Използване на системния процес на ``tor`` в macOS

source: First, install `Homebrew <https://brew.sh/>`_ if you don't already have it, and then install Tor::
bg: Първо инсталирайте `Homebrew <https://brew.sh/>`_, и след това инсталирайте Tor::

source: Now configure Tor to allow connections from OnionShare::
bg: След това настройте Tor, за да може OnionShare да го използва::

source: And start the system Tor service::
bg: Добавете и стартирайте услугата на Tor::

source: Open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using socket file", and set the socket file to be ``/usr/local/var/run/tor/control.socket``. Under "Tor authentication settings" choose "No authentication, or cookie authentication". Click the "Test Connection to Tor" button.
bg: Отворете OnionShare, щракнете върху пиктограмата „⚙“ и отворете раздела „Настройки на Tor“. Под "Как OnionShare да се свързва с мрежата на Tor?" изберете „Свързване, чрез файл на сокет“ и за файла на сокет задайте ``/usr/local/var/run/tor/control.socket``. Махнете отметката на „Без удостоверяване, нито с бисквитка“ и в полето „Парола“ въведете изпраната по-рано парола. Щракнете върху бутона „Проверка на връзката с Тор“.

source: If all goes well, you should see "Connected to the Tor controller".
bg: Ако всичко е наред, трябва да видите „Има връзка с контролер на Tor“.

source: Using a system ``tor`` in Linux
bg: Използване на системния процес на ``tor`` в Линукс

source: First, install the ``tor`` package. If you're using Debian, Ubuntu, or a similar Linux distro, It is recommended to use the Tor Project's `official repository <https://support.torproject.org/apt/tor-deb-repo/>`_.
bg: Първа инсталирайте пакета ``tor``. Ако използвате Debian, Ubuntu или подобна дистрибуция на Линукс, е препоръчително да използвате `официалното хранилище на Tor Project <https://support.torproject.org/apt/tor-deb-repo/>`_.

source: Next, add your user to the group that runs the ``tor`` process (in the case of Debian and Ubuntu, ``debian-tor``) and configure OnionShare to connect to your system ``tor``'s control socket file.
bg: След това добавете потребителя си в групата, която управлява процеса ``tor`` (в случая на Debian и Ubuntu, ``debian-tor``), и настройте OnionShare да се свързва с файла на контролния сокет на ``tor``.

source: Add your user to the ``debian-tor`` group by running this command (replace ``username`` with your actual username)::
bg: Добавете потребителя си в групата ``debian-tor``, като изпълните тази команда (заменете ``username`` с потребителското си име)::

source: Reboot your computer. After it boots up again, open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using socket file". Set the socket file to be ``/var/run/tor/control``. Under "Tor authentication settings" choose "No authentication, or cookie authentication". Click the "Test Connection to Tor" button.
bg: Рестартирайте устройството. След това, отворете отново OnionShare, щракнете върху пиктограмата „⚙“ и отворете раздела „Настройки на Tor“. Под "Как OnionShare да се свързва с мрежата на Tor?" изберете „Свързване, чрез файл на сокет“. Задайте за файла на сокета ``/usr/local/var/run/tor/control.socket``. Махнете отметката на „Без удостоверяване, нито с бисквитка“ и в полето „Парола“ въведете изпраната по-рано парола. Щракнете върху бутона „Проверка на връзката с Тор“.
